{
    "Mchele": "Mchele unahitaji udongo wenye unyevu mwingi, pH kati ya 5.5 hadi 6.5, na joto la 25–30°C. Msimu mzuri wa kupanda ni Machi hadi Mei.",
    "Mahindi": "Mahindi hustawi vizuri kwenye udongo wenye rutuba na pH kati ya 5.5–7.0 na mvua ya wastani. Msimu mzuri wa kupanda ni Novemba hadi Januari.",
    "Mbaazi": "Mbaazi inahitaji udongo wa kichanga au tifutifu na pH kati ya 6.0–7.5. Hupandwa baada ya mvua kubwa, Aprili au Novemba.",
    "Maharage": "Maharage yanahitaji udongo tifutifu, pH 6.0–7.5 na mvua ya wastani. Msimu mzuri wa kupanda ni Machi hadi Mei.",
    "Njegere": "Njegere hustawi kwenye udongo wenye rutuba, pH 6.0–7.5, na hali ya baridi kiasi. Msimu mzuri wa kupanda ni Mei hadi Julai.",
    "Choroko": "Choroko hustawi vizuri kwenye udongo mwepesi na pH ya 5.5–7.5. Hupandwa Oktoba hadi Desemba.",
    "Dengu": "Dengu inahitaji udongo usio na maji mengi, pH 6.0–7.0 na mvua ndogo. Msimu mzuri wa kupanda ni Desemba hadi Februari.",
    "Komamanga": "Komamanga hustawi kwenye udongo wenye mchanga mwingi na pH ya 5.5–7.0. Hupandwa mwanzoni mwa mvua – Machi au Oktoba.",
    "Ndizi": "Ndizi zinahitaji udongo tifutifu, rutuba nyingi na pH 5.5–6.5, pamoja na unyevu mwingi. Inaweza kupandwa wakati wowote wenye unyevu wa kutosha.",
    "Maembe": "Maembe yanahitaji joto la wastani, udongo wa mchanga na pH 5.5–7.5. Msimu mzuri wa kupanda ni wakati wa mvua – Machi au Oktoba.",
    "Zabibu": "Zabibu hustawi vizuri kwenye udongo wa kichanga wenye mifereji na pH 5.5–6.5. Hupandwa Januari hadi Machi.",
    "Matikiti": "Matikiti yanapendelea udongo mwepesi na joto la wastani, pH 6.0–6.8. Msimu mzuri wa kupanda ni Oktoba hadi Desemba.",
    "Matango": "Matango yanahitaji udongo wenye rutuba ya kutosha na pH kati ya 6.0–6.8. Msimu mzuri wa kupanda ni Oktoba hadi Januari.",
    "Tufaa": "Tufaa hustawi maeneo ya baridi, udongo tifutifu na pH 6.0–7.0. Hupandwa wakati wa baridi, Julai hadi Septemba.",
    "Machungwa": "Machungwa yanahitaji udongo wenye rutuba, mifereji mizuri na pH 5.5–6.5. Msimu mzuri wa kupanda ni Aprili hadi Juni.",
    "Mapapai": "Mapapai yanapendelea udongo tifutifu, joto la wastani na pH 5.5–7.0. Msimu mzuri wa kupanda ni Machi hadi Mei.",
    "Nazi": "Nazi hustawi karibu na pwani kwenye udongo wenye mchanga na pH ya 5.5–7.0. Hupandwa wakati wowote wenye mvua ya kutosha.",
    "Pamba": "Pamba hustawi kwenye udongo wenye mchanga mwingi, mvua ya wastani na pH 5.5–7.0. Msimu mzuri wa kupanda ni Desemba hadi Februari.",
    "Kahawa": "Kahawa hustawi vizuri maeneo ya milimani, pH 6.0–6.5 na joto la wastani. Msimu mzuri wa kupanda ni Machi hadi Mei.",
    "Mtama": "Mtama ni zao linalostahimili ukame, hustawi kwenye udongo wa kati na pH 5.5–7.0. Msimu mzuri wa kupanda ni Machi hadi Mei.",
    "Uwele": "Uwele unahitaji udongo mwepesi, pH 5.5–7.0 na mvua ya wastani. Hupandwa Oktoba hadi Desemba.",
    "Pea": "Pea hustawi kwenye udongo wenye rutuba na baridi kiasi, pH 6.0–7.5. Msimu mzuri wa kupanda ni Mei hadi Julai.",
    "Ngano": "Ngano hustawi kwenye maeneo yenye hali ya baridi kiasi, pH ya 6.0–7.5 na mvua ya wastani. Hupandwa Juni hadi Agosti."
  }